podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/PORTA_MKL82Z7.svd.xml
            <register>
               <name>ISFR</name>
               <description>Interrupt Status Flag Register\n
Reflects the interrupt status of each pin</description>
               <addressOffset>0xA0</addressOffset>
               <fields>
                  <field>
                     <name>ISF0</name>
                     <description>Interrupt Status Flag</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No interrupt</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Interrupt pending</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="ISF0" > <name>ISF1</name> <description>Interrupt Status Flag 1</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="ISF0" > <name>ISF2</name> <description>Interrupt Status Flag 2</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="ISF0" > <name>ISF3</name> <description>Interrupt Status Flag 3</description> <bitOffset>3</bitOffset> </field>
                  <field derivedFrom="ISF0" > <name>ISF4</name> <description>Interrupt Status Flag 4</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="ISF0" > <name>ISF5</name> <description>Interrupt Status Flag 5</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="ISF0" > <name>ISF6</name> <description>Interrupt Status Flag 6</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="ISF0" > <name>ISF7</name> <description>Interrupt Status Flag 7</description> <bitOffset>7</bitOffset> </field>
                  <field derivedFrom="ISF0" > <name>ISF8</name> <description>Interrupt Status Flag 8</description> <bitOffset>8</bitOffset> </field>
                  <field derivedFrom="ISF0" > <name>ISF9</name> <description>Interrupt Status Flag 9</description> <bitOffset>9</bitOffset> </field>
                  <field derivedFrom="ISF0" > <name>ISF10</name> <description>Interrupt Status Flag 10</description> <bitOffset>10</bitOffset> </field>
                  <field derivedFrom="ISF0" > <name>ISF11</name> <description>Interrupt Status Flag 11</description> <bitOffset>11</bitOffset> </field>
                  <field derivedFrom="ISF0" > <name>ISF12</name> <description>Interrupt Status Flag 12</description> <bitOffset>12</bitOffset> </field>
                  <field derivedFrom="ISF0" > <name>ISF13</name> <description>Interrupt Status Flag 13</description> <bitOffset>13</bitOffset> </field>
                  <field derivedFrom="ISF0" > <name>ISF14</name> <description>Interrupt Status Flag 14</description> <bitOffset>14</bitOffset> </field>
                  <field derivedFrom="ISF0" > <name>ISF15</name> <description>Interrupt Status Flag 15</description> <bitOffset>15</bitOffset> </field>
                  <field derivedFrom="ISF0" > <name>ISF16</name> <description>Interrupt Status Flag 16</description> <bitOffset>16</bitOffset> </field>
                  <field derivedFrom="ISF0" > <name>ISF17</name> <description>Interrupt Status Flag 17</description> <bitOffset>17</bitOffset> </field>
                  <field derivedFrom="ISF0" > <name>ISF18</name> <description>Interrupt Status Flag 18</description> <bitOffset>18</bitOffset> </field>
                  <field derivedFrom="ISF0" > <name>ISF19</name> <description>Interrupt Status Flag 19</description> <bitOffset>19</bitOffset> </field>
                  <field derivedFrom="ISF0" > <name>ISF20</name> <description>Interrupt Status Flag 20</description> <bitOffset>20</bitOffset> </field>
                  <field derivedFrom="ISF0" > <name>ISF21</name> <description>Interrupt Status Flag 21</description> <bitOffset>21</bitOffset> </field>
                  <field derivedFrom="ISF0" > <name>ISF22</name> <description>Interrupt Status Flag 22</description> <bitOffset>22</bitOffset> </field>
                  <field derivedFrom="ISF0" > <name>ISF23</name> <description>Interrupt Status Flag 23</description> <bitOffset>23</bitOffset> </field>
                  <field derivedFrom="ISF0" > <name>ISF24</name> <description>Interrupt Status Flag 24</description> <bitOffset>24</bitOffset> </field>
                  <field derivedFrom="ISF0" > <name>ISF25</name> <description>Interrupt Status Flag 25</description> <bitOffset>25</bitOffset> </field>
                  <field derivedFrom="ISF0" > <name>ISF26</name> <description>Interrupt Status Flag 26</description> <bitOffset>26</bitOffset> </field>
                  <field derivedFrom="ISF0" > <name>ISF27</name> <description>Interrupt Status Flag 27</description> <bitOffset>27</bitOffset> </field>
                  <field derivedFrom="ISF0" > <name>ISF28</name> <description>Interrupt Status Flag 28</description> <bitOffset>28</bitOffset> </field>
                  <field derivedFrom="ISF0" > <name>ISF29</name> <description>Interrupt Status Flag 29</description> <bitOffset>29</bitOffset> </field>
                  <field derivedFrom="ISF0" > <name>ISF30</name> <description>Interrupt Status Flag 30</description> <bitOffset>30</bitOffset> </field>
                  <field derivedFrom="ISF0" > <name>ISF31</name> <description>Interrupt Status Flag 31</description> <bitOffset>31</bitOffset> </field>
               </fields>
            </register>
         </registers>
      </peripheral>
